Books_And_Tutorials/DeadLock/DeadLock.org
#+BEGIN_HTML
<meta http-equiv="Content-Style-Type" content="text/css">
<link rel="stylesheet" href="../../CSS/org-style.css" type="text/css" />
<div id="postamble">
<p class="author"> Author: Pralay Patoria
<a href="mailto:ppatoria@gmail.com">&lt;ppatoria@gmail.com&gt;</a>
</p>
<p class="date"> Date: 01-12-2013</p>
</div>
#+END_HTML

#+TITLE: Deadlock scenarious in HermesAPI C++ Version.

#+OPTIONS: date:nil, creator:nil, author:nil	

* Deadlock Scenarious
  - Reference:
    -  [[./deadlock_scenarious.html][Deadlock Scenarious faced in current project(s)]] 
    -  [[../DotNet/deadlock/deadlock_in_csharp.html][Deadlock Scenarious in CSharp]]
* Deadlock Prevention: 
  - Reference:
    - [[../cpp/books/C++ Concurrency in Action/3. Sharing data between threads.pdf][C++ Concurrency in Action : Sharing data between threads]]
** AVOID NESTED LOCKS
** AVOID CALLING USER-SUPPLIED CODE WHILE HOLDING A LOCK
** ACQUIRE LOCKS IN A FIXED ORDER
** USE A LOCK HIERARCHY 
   - Code Sample:
     -  [[../../code/cpp/threading/deadlock/lockhierarchy][Lock Hierarchy CPP]]
     -  [[../../Code/CSharp/Threading/Deadlock/LockLeveling/LeveledLock.cs][Lock Hierarchy CSharp]]
	
- More Code Sample for Deadlock: [[../../Code/CPP/threading/Deadlock][Deadlock Samples]]
