Books_And_Tutorials/DeadLock/DeadLock.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Deadlock scenarious in HermesAPI C++ Version.</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-12-26 17:21:15 "/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Deadlock scenarious in HermesAPI C++ Version.</h1>


<meta http-equiv="Content-Style-Type" content="text/css">
<link rel="stylesheet" href="../../CSS/org-style.css" type="text/css" />
<div id="postamble">
<p class="author"> Author: Pralay Patoria
<a href="mailto:ppatoria@gmail.com">&lt;ppatoria@gmail.com&gt;</a>
</p>
<p class="date"> Date: 01-12-2013</p>
</div>




<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Deadlock Scenarious </a></li>
<li><a href="#sec-2">2 Deadlock Prevention: </a>
<ul>
<li><a href="#sec-2_1">2.1 AVOID NESTED LOCKS </a></li>
<li><a href="#sec-2_2">2.2 AVOID CALLING USER-SUPPLIED CODE WHILE HOLDING A LOCK </a></li>
<li><a href="#sec-2_3">2.3 ACQUIRE LOCKS IN A FIXED ORDER </a></li>
<li><a href="#sec-2_4">2.4 USE A LOCK HIERARCHY </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Deadlock Scenarious </h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>
Reference:
<ul>
<li>
 <a href="./deadlock_scenarious.html">Deadlock Scenarious faced in current project(s)</a> 
</li>
<li>
 <a href="../DotNet/deadlock/deadlock_in_csharp.html">Deadlock Scenarious in CSharp</a>
</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Deadlock Prevention: </h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>
Reference:
<ul>
<li>
<a href="../cpp/c++_concurrency_in_action/CConcurrencyinActionPracticalMultithreadingChapter3Sharingdatabetwee.pdf">C++ Concurrency in Action : Sharing data between threads</a>
</li>
</ul>
</li>
</ul>

</div>

<div id="outline-container-2_1" class="outline-3">
<h3 id="sec-2_1"><span class="section-number-3">2.1</span> AVOID NESTED LOCKS </h3>
<div class="outline-text-3" id="text-2_1">

</div>

</div>

<div id="outline-container-2_2" class="outline-3">
<h3 id="sec-2_2"><span class="section-number-3">2.2</span> AVOID CALLING USER-SUPPLIED CODE WHILE HOLDING A LOCK </h3>
<div class="outline-text-3" id="text-2_2">

</div>

</div>

<div id="outline-container-2_3" class="outline-3">
<h3 id="sec-2_3"><span class="section-number-3">2.3</span> ACQUIRE LOCKS IN A FIXED ORDER </h3>
<div class="outline-text-3" id="text-2_3">

</div>

</div>

<div id="outline-container-2_4" class="outline-3">
<h3 id="sec-2_4"><span class="section-number-3">2.4</span> USE A LOCK HIERARCHY </h3>
<div class="outline-text-3" id="text-2_4">

<ul>
<li>
Code Sample:
<ul>
<li>
 <a href="../../code/cpp/threading/deadlock/lockhierarchy">Lock Hierarchy CPP</a>
</li>
<li>
 <a href="../../Code/CSharp/LockLeveling/LockLeveling.cs">Lock Hierarchy CSharp</a>

</li>
</ul>
</li>
<li>
More Code Sample for Deadlock: <a href="../../Code/CPP/threading/Deadlock">Deadlock Samples</a>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble">
<p class="date"> Date: 2013-12-26 17:21:15 </p>
</div>
</div>
</body>
</html>
